Emacs.org
#+TITLE: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* Required system packages

** Fonts

- =fira-code=
- =fira-sans=
- =cantarell=
  
** Theming

- =pywal=
  
* Package system initialization

#+begin_src emacs-lisp
  (require 'package)
  (setq package-enable-at-startup nil)

  ;; Setup package sources
  (setq package-archives '(("elpa"   . "http://elpa.gnu.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("melpa" . "https://melpa.org/packages/")))

  (package-initialize)

  (unless package-archive-contents
    (package-refresh-contents))

  ;; Install use-package if it isn't already installed
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  ;; Always ensure packages are installed
  (require 'use-package)
  (setq use-package-always-ensure t)
#+end_src

* Keybinding configuration
** Escape also bails out

#+begin_src emacs-lisp
  ;; Makes escape behave like C-g
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src

** evil

#+begin_src emacs-lisp
  ;; (use-package evil
  ;;   :init
  ;;   (setq evil-want-integration t)
  ;;   (setq evil-want-keybinding nil)
  ;;   :config
  ;;   (evil-mode 1)
  ;;   (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state))

  ;; (use-package evil-collection
  ;;   :after evil
  ;;   :config
  ;;   (evil-collection-init))
#+end_src
** general

#+begin_src emacs-lisp
  ;; (use-package general
  ;;   :config
  ;;   (general-create-definer cjv/leader-keys
  ;;     :keymaps '(normal insert visual emacs)
  ;;     :prefix "SPC"
  ;;     :global-prefix "C-SPC")

  ;;   (cjv/leader-keys
  ;;    "t"  '(:ignore t :which-key "toggles")
  ;;    "tt" '(counsel-load-theme :which-key "choose theme")))
#+end_src
** hydra

#+begin_src emacs-lisp
  (use-package hydra)
#+end_src

*** Hydras

**** Text scaling

#+begin_src emacs-lisp
  ;; (defhydra hydra-text-scale (:timeout 4)
  ;;   "scale text"
  ;;   ("j" text-scale-increase "in")
  ;;   ("k" text-scale-decrease "out")
  ;;   ("f" nil "finished" :exit t))
#+end_src

*** Leader keys

#+begin_src emacs-lisp
  ;; (cjv/leader-keys
  ;;   "ts" '(hydra-text-scale/body :which-key "scale text"))
#+end_src

* UI configuration
** Basic UI configuration
#+begin_src emacs-lisp
  ;; Disable default init screen
  (setq inhibit-startup-message t)

  ;; Enable visible bell
  (setq visible-bell t)

  (scroll-bar-mode -1) ; Disable scrollbar
  (menu-bar-mode -1)   ; Disable menu bar
  (tool-bar-mode -1)   ; Disable tool bar
  (tooltip-mode -1)    ; Disable tooltips

  (set-fringe-mode 10) ; Set some spacing between windows
#+end_src

** Line numbers

#+begin_src emacs-lisp
  ;; Enable column numbers on modeline
  (column-number-mode)

  ;; Disable line numbers for some modes
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  vterm-mode-hook
                  pdf-view-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

** Font Configuration

#+begin_src emacs-lisp
  (defvar cjv/default-font-size 160)

  (set-face-attribute 'default nil :font "Fira Code" :height cjv/default-font-size)
  (set-face-attribute 'fixed-pitch nil :font "Fira Code" :height cjv/default-font-size)
  (set-face-attribute 'variable-pitch nil :font "Cantarell" :height cjv/default-font-size :weight 'regular);
#+end_src

** Theming

#+begin_src emacs-lisp
  ;; doom-themes has most popular colorschemes
  (use-package doom-themes)

  ;; Sets up solar for use with circadian
  (use-package solar
    :ensure nil ; built-in package
    :config
    (setq calendar-latitude 38.72 ; Lisbon coordinates
          calendar-longitude -9.14))

  ;; Sets a light theme during the day and a dark theme during the night
  (use-package circadian
    :after solar
    :config
    (setq circadian-themes '((:sunrise . doom-one-light)
                             (:sunset  . doom-one)))
    (circadian-setup))

  ;; Automatically applies emacs's theme to the rest of the system
  ;; Requires pywal
  (use-package theme-magic
    :config
    (theme-magic-export-theme-mode))

  ;; The first time the configuration is loaded, run:
  ;; M-x all-the-icons-install-fonts
  (use-package all-the-icons)
#+end_src

** Modeline

#+begin_src emacs-lisp
  (use-package doom-modeline
    :init
    (doom-modeline-mode 1))
#+end_src

** Completion
*** Ivy

#+begin_src emacs-lisp
  (use-package ivy
    :diminish
    :bind (("C-s" . swiper))
    :init
    (ivy-mode 1))

  (use-package ivy-rich
    :init
    (ivy-rich-mode 1))
#+end_src

*** Counsel

#+begin_src emacs-lisp
  (use-package counsel
    :config
    (counsel-mode 1))
#+end_src

** which-key

#+begin_src emacs-lisp
  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode)
#+end_src

** helpful

#+begin_src emacs-lisp
  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+end_src

** rainbow-delimeters

#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

* Miscellaneous behavior
** Backups

#+begin_src emacs-lisp
  (setq backup-directory-alist `(("." . ,(expand-file-name "tmp/backups/" user-emacs-directory))))

  (make-directory (expand-file-name "tmp/auto-saves" user-emacs-directory) t)
  (setq auto-save-list-file-prefix (expand-file-name "tmp/auto-saves/sessions/" user-emacs-directory)
          auto-save-file-name-transforms `((".*" ,(expand-file-name "tmp/auto-saves/" user-emacs-directory) t)))

  (use-package no-littering)
#+end_src

** Save last place in a file

#+begin_src emacs-lisp
(save-place-mode 1)
#+end_src

* Development
** Projectile

#+begin_src emacs-lisp
  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    (when (file-directory-p "~/Projects")
      (setq projectile-project-search-path '("~/Projects")))
    (setq projectile-switch-project-action #'projectile-dired))

#+end_src

*** Counsel integration

#+begin_src emacs-lisp
  (use-package counsel-projectile
    :config (counsel-projectile-mode))
#+end_src

** Magit

#+begin_src emacs-lisp
  (use-package magit)
#+end_src

** vterm

#+begin_src emacs-lisp
  (use-package vterm) 
#+end_src

** format-all

#+begin_src emacs-lisp
  (use-package format-all
    :config
    (format-all-mode))
#+end_src

* Org-mode
** Custom functions
*** Fonts

#+begin_src emacs-lisp
  (defun cjv/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    ;; (auto-fill-mode 0)
    (visual-line-mode 1))

  (defun cjv/org-font-setup ()
    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    ;; Set faces for heading levels
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "Fira Sans" :weight 'regular :height (cdr face)))

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    ;; Use describe-face to find more
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

#+end_src

*** Visual fill

#+begin_src emacs-lisp
  (defun cjv/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :defer t
    :hook (org-mode . cjv/org-mode-visual-fill))
#+end_src

**** TODO Check if I want to keep this setup or writeroom-mode/zen-mode (watch Protesilaos's video on this topic)
