Emacs.org
* EXWM

#+begin_src emacs-lisp
  (defun cjv/exwm-update-class ()
    (exwm-workspace-rename-buffer exwm-class-name))

  (use-package exwm
    :config
    (setq exwm-workspace-number 5)

    (add-hook 'exwm-update-class-hook #'cjv/exwm-update-class)
    ;; (add-hook 'exwm-init-hook #'cjv/exwm-init-hook)

    ;(start-process-shell-command "unclutter" nil "unclutter")

    ;; Launch apps that will run in the background
    ;;(cjv/run-in-background "nm-applet"))

    ;; Setup muti-head setup
    (require 'exwm-randr)
    (exwm-randr-enable)
    (start-process-shell-command "xrandr" nil "xrandr --output DVI-1 --primary --mode 1920x1080 --rate 144 --output DVI-0 --mode 1920x1080 --right-of DVI-1")

    (setq exwm-randr-workspace-monitor-plist '(2 "DVI-0" 3 "DVI-0"))
    (setq exwm-workspace-warp-cursor t)

    (require 'exwm-systemtray)
    ;; (setq exwm-systemtray-height 32)
    (exwm-systemtray-enable)

    (display-time)
    ;; (display-battery-mode)
    (setq exwm-input-prefix-keys
          '(?\C-x
            ?\C-u
            ?\C-h
            ?\M-x
            ?\M-`
            ?\M-&
            ?\M-:
            ?\C-\M-j
            ?\C-\ ))

    (define-key exwm-mode-map [?\C-q] 'exwm-input-send-next-key)

    (setq exwm-input-global-keys
          `(
            ([?\s-r] . exwm-reset)

            ([s-left] . windmove-left)
            ([?\s-h] . windmove-left)

            ([s-right] . windmove-right)
            ([?\s-l] . windmove-right)

            ([s-up] . windmove-up)
            ([?\s-k] . windmove-up)

            ([s-down] . windmove-down)
            ([?\s-j] . windmove-down)

            ([?\s-.] . counsel-find-file)
            ([?\s-,] . counsel-switch-buffer)

            ;; ([?\s->] . ) depois separar entre dentro do workspace e fora do workspace
            ;; ([?\s-<] . )

            ([?\s-&] . (lambda (command)
                         (interactive (list (read-shell-command "$ ")))
                         (start-process-shell-command command nil command)))

            ;; ([?\s-p] . dmenu)

            ([?\s-w] . exwm-workspace-switch)
            ([?\s-`] . (lambda () (interactive)
                         (exwm-workspace-switch-create 0)))


            ,@(mapcar (lambda (i)
                        `(,(kbd (format "s-%d" i)) .
                          (lambda ()
                            (interactive)
                            (exwm-workspace-switch-create ,i))))
                      (number-sequence 0 9))))

    (exwm-enable))
  ;; EXWM improvements
  ;; (defun cjv/run-in-background (command)
  ;;   (let ((command-parts (split-string command "[ ]+")))
  ;;     (apply #'call-process `(,(car command-parts) nil 0 nil ,@(cdr command-parts)))))

  (defun cjv/exwm-init-hook ()
    ;; Make workspace 1 be the one we land at startup
    (exwm-workspace-switch-create 1))

#+end_src

** TODO Move EXWM configuration to a separate file

